<a href="https://colab.research.google.com/github/jethompson023/CS-491/blob/main/CS491Midterm.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import numpy as np
import pandas as pd
import sys

Q1. Consider an online store data store. A customer has an ID and a name. A vendor has an ID and a name. Finally, a purchase tells us which customer made a purchase from which store and for how much. Write code to create the customer, vendor, and purchase data frames with some example data. Two or three rows per data frame is fine. Replicate the customer ID and vendor ID in the purchase data frame.

In [ ]:
#Create a DataFrame for all the Customers
d1 = pd.DataFrame(
      {'id': ['258962', '545789', '100256'], 
      'First_Name': ['Jason', 'Jason', 'Tina'],
      'Last_Name': ['Miller', 'Jacobson', 'Ali']})
df = pd.DataFrame(d1)
df.set_index('id')

#Create DataFrame for all Venders
d2 = pd.DataFrame(
      {'venderId': ['962582', '457920', '546017'], 
      'vender_Name': ['The Lunch Box', 'Urban Safari', 'Heathy House']})
df2 = pd.DataFrame(d2)
df2.set_index('venderId')

#Create a DataFrame for all the Purchases
d3 = pd.DataFrame(
      {'id': [d1[['id']].iloc[0], d1[['id']].iloc[1], d1[['id']].iloc[2], d1[['id']].iloc[2], d1[['id']].iloc[1], d1[['id']].iloc[2]],
       'First Name': [d1[['First_Name']].iloc[0], d1[['First_Name']].iloc[1], d1[['First_Name']].iloc[2], d1[['First_Name']].iloc[2], d1[['First_Name']].iloc[1], d1[['First_Name']].iloc[2]],
       'Vender': [d2[['vender_Name']].iloc[0], d2[['vender_Name']].iloc[1], d2[['vender_Name']].iloc[2], d2[['vender_Name']].iloc[2], d2[['vender_Name']].iloc[1], d2[['vender_Name']].iloc[2]],
      'customerPurchase': ['Turkey Lime Sandwich', 'Chill Pepper Fries', 'Asian Zing Wings', 'Stuffed Potato', 'Cheese Pizza', 'Breadsticks'], 
      'price': [5.23,6.30, 8.59, 5.60, 9.50, 10.25]})
df3 = pd.DataFrame(d3)
df3

                                    id  ...  price
0  id    258962
Name: 0, dtype: object  ...   5.23
1  id    545789
Name: 1, dtype: object  ...   6.30
2  id    100256
Name: 2, dtype: object  ...   8.59
3  id    100256
Name: 2, dtype: object  ...   5.60
4  id    545789
Name: 1, dtype: object  ...   9.50
5  id    100256
Name: 2, dtype: object  ...  10.25

[6 rows x 5 columns]

Q2. Write code that finds the name of the customer that has spent the most money. If there is a tie, then display all customers that tied.

In [ ]:
column = customerPurchase['price']
column2 = customerPurchase['id']

#Find the Max Value in the Price Column
spentMore = column.max()
if(spentMore == 10.25):
  print(d1[['First_Name']].iloc[2])

First_Name    Tina
Name: 2, dtype: object

Q3. Write code that finds the dollar amount of the average purchase.

In [ ]:
avg = customerPurchase['price'].mean()
avg

7.578333333333333

Q4. Write code that finds which vendor has made the most money. If there is a tie, then display all vendors that tied. For each vendor in the result, display the name of the vendor.

In [ ]:
price = df3['price']
vender = df3['Vender']
#Find the Max Value in the Price Column
maxPrice = price.max()

if(maxPrice > 1):
  print(df3[['Vender']].iloc[4])
  print(maxPrice)

Vender    vender_Name    Urban Safari
Name: 1, dtype: ob...
Name: 4, dtype: object
10.25

Q5. Write code that finds which customer has bought the most items. If there is a tie, then display all customers that tied. For each customer in the result, display the name of the customer.

In [ ]:
column = customerPurchase['price']
column2 = customerPurchase['id']

#Find the Max Value in the Price Column
spentMore = column.max()
if(spentMore == 10.25):
  print(d1[['First_Name']].iloc[2])

First_Name    Tina
Name: 2, dtype: object

Q6. Write code that finds which customer has made the most expensive single purchase. If there is a tie, then display all customers that tied. For each customer in the result, display the name of the customer.

In [ ]:
column = customerPurchase['price']
column2 = customerPurchase['id']

#Find the Max Value in the Price Column
spentMore = column.max()
if(spentMore == 10.25):
  print(d1[['First_Name']].iloc[2])

First_Name    Tina
Name: 2, dtype: object

Q7[4] Write code that creates a 10x10 NumPy array of random numbers. Each number should be an integer between 1 and 10.

In [ ]:
randArray = np.random.uniform(size=(10,10), low = 0.0, high = 10.0)
arrayDf = pd.DataFrame(randArray, index=[1,2,3,4,5,6,7,8,9,10], columns=[1,2,3,4,5,6,7,8,9,10])
arrayDf = arrayDf.round(0)
print(arrayDf)

      1     2     3     4    5    6    7    8     9    10
1    1.0   2.0   7.0   0.0  1.0  7.0  7.0  4.0   7.0  7.0
2    3.0   4.0   1.0   3.0  4.0  9.0  0.0  1.0   1.0  8.0
3    6.0   3.0   5.0   3.0  2.0  9.0  5.0  8.0  10.0  9.0
4    9.0  10.0   2.0   2.0  4.0  3.0  9.0  1.0   3.0  9.0
5    0.0   5.0  10.0  10.0  5.0  5.0  4.0  1.0   7.0  8.0
6   10.0   5.0   5.0   7.0  8.0  4.0  7.0  6.0   8.0  7.0
7    0.0   9.0   4.0   7.0  5.0  5.0  7.0  7.0   7.0  9.0
8    8.0   4.0   9.0   3.0  4.0  1.0  5.0  8.0   7.0  9.0
9    3.0   5.0   2.0   1.0  2.0  6.0  5.0  1.0   4.0  9.0
10   4.0   2.0   6.0   5.0  5.0  2.0  8.0  5.0   7.0  3.0

Q8[4] Write code that finds the smallest number in each column.

In [ ]:
smallNums = arrayDf.min()
smallNums

1     0.0
2     2.0
3     1.0
4     0.0
5     1.0
6     1.0
7     0.0
8     1.0
9     1.0
10    3.0
dtype: float64

Q9[4] Write code that finds the sum of the two smallest numbers in each row.

In [ ]:
def arraySum(smallNums):
  size = len(smallNums)
  first = second = sys.maxint
  for i in range (0, size):
    if smallNums[i] < first:
      second = first
      first = smallNums[i]
    elif (smallNums[i] < second and smallNums[i] != first):
      second = smallNums[i];
  if (second == sys.maxint):
    sum = first + second
  else:
    print("Error")
sum

0    3.0
dtype: float64

Q10[5]. On which day of 2019 did the TSLA stock made the greatest percent jump, that is, the difference between the closing and opening price divided by the opening price was the greatest. What was the percent jump?

In [ ]:
from pandas_datareader import data
tsla = data.DataReader('TSLA', 'yahoo', start = '2019', end= '2020')
 
tsla['Percent Change'] = (tsla['Close'] - tsla['Open'])/tsla['Open']
tsla = tsla.reset_index()

findMax = tsla[['Date', 'Percent Change']]
max = findMax.max()
print(max)

Date              2019-12-31 00:00:00
Percent Change               0.102143
dtype: object

Q11[5] On which day of 2019 did the TSLA stock and GOOG stock showed the greatest disparity. That is the difference of the percent change of the two stocks was the greatest. For example, if on a certain day the TSLA stock went up 5% and the GOOG stock went down 3%, then the total disparity between the two stocks on this day is 8%.

In [ ]:
goog = data.DataReader('GOOG', 'yahoo', start = '2019', end= '2020')
goog['Percent Change'] = (goog['Close'] - goog['Open'])/goog['Open']
goog = goog.reset_index()

findGMax = goog[['Date', 'Percent Change']]
max1 = findGMax.max()
greatestDisparity = max - max1
print(greatestDisparity)

Date              0 days 00:00:00
Percent Change          0.0606892
dtype: object